; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s6-p13-a5)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l0-2 l0-3 l0-4 l0-5 l1-0 l1-1 l1-2 l1-3 l1-4 l1-5 l2-0 l2-1 l2-2 l2-3 l2-4 l2-5 l3-0 l3-1 l3-2 l3-3 l3-4 l3-5 l4-0 l4-1 l4-2 l4-3 l4-4 l4-5 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l0-2)
    (in-city  l0-2 c0)
    (LOCATION l0-3)
    (in-city  l0-3 c0)
    (LOCATION l0-4)
    (in-city  l0-4 c0)
    (LOCATION l0-5)
    (in-city  l0-5 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l1-2)
    (in-city  l1-2 c1)
    (LOCATION l1-3)
    (in-city  l1-3 c1)
    (LOCATION l1-4)
    (in-city  l1-4 c1)
    (LOCATION l1-5)
    (in-city  l1-5 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l2-2)
    (in-city  l2-2 c2)
    (LOCATION l2-3)
    (in-city  l2-3 c2)
    (LOCATION l2-4)
    (in-city  l2-4 c2)
    (LOCATION l2-5)
    (in-city  l2-5 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l3-2)
    (in-city  l3-2 c3)
    (LOCATION l3-3)
    (in-city  l3-3 c3)
    (LOCATION l3-4)
    (in-city  l3-4 c3)
    (LOCATION l3-5)
    (in-city  l3-5 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (LOCATION l4-2)
    (in-city  l4-2 c4)
    (LOCATION l4-3)
    (in-city  l4-3 c4)
    (LOCATION l4-4)
    (in-city  l4-4 c4)
    (LOCATION l4-5)
    (in-city  l4-5 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (OBJ p10)
    (OBJ p11)
    (OBJ p12)
    (at t0 l0-5)
    (at t1 l1-5)
    (at t2 l2-3)
    (at t3 l3-1)
    (at t4 l4-3)
    (at p0 l1-3)
    (at p1 l1-4)
    (at p2 l2-2)
    (at p3 l0-5)
    (at p4 l2-4)
    (at p5 l2-1)
    (at p6 l2-2)
    (at p7 l2-1)
    (at p8 l2-2)
    (at p9 l2-0)
    (at p10 l2-0)
    (at p11 l2-3)
    (at p12 l3-3)
    (at a0 l0-0)
    (at a1 l0-0)
    (at a2 l2-0)
    (at a3 l3-0)
    (at a4 l3-0)
)
(:goal
    (and
        (at p0 l1-4)
        (at p1 l1-1)
        (at p2 l2-4)
        (at p3 l4-1)
        (at p4 l1-4)
        (at p5 l4-1)
        (at p6 l1-1)
        (at p7 l3-2)
        (at p8 l2-3)
        (at p9 l0-4)
        (at p10 l3-0)
        (at p11 l1-2)
        (at p12 l3-1)
    )
)

  (:constraints
    (and
      (always (not (in p0 a0)))
      (always (not (in p0 a1)))
      (always (not (in p0 a2)))
      (always (not (in p0 a3)))
      (always (not (in p0 a4)))
      (always (not (in p1 a0)))
      (always (not (in p1 a1)))
      (always (not (in p1 a2)))
      (always (not (in p1 a3)))
      (always (not (in p1 a4)))
      (always (not (in p12 a0)))
      (always (not (in p12 a1)))
      (always (not (in p12 a2)))
      (always (not (in p12 a3)))
      (always (not (in p12 a4)))
      (always (not (in p2 a0)))
      (always (not (in p2 a1)))
      (always (not (in p2 a2)))
      (always (not (in p2 a3)))
      (always (not (in p2 a4)))
      (always (not (in p8 a0)))
      (always (not (in p8 a1)))
      (always (not (in p8 a2)))
      (always (not (in p8 a3)))
      (always (not (in p8 a4)))
    )
  )
)

; plan
1. (fly-airplane a2 l2-0 l3-0)
   deleted: (at a2 l2-0)
   added: (at a2 l3-0)
   goals met: 0 of 13
2. (drive-truck t4 l4-3 l4-1 c4)
   deleted: (at t4 l4-3)
   added: (at t4 l4-1)
   goals met: 0 of 13
3. (drive-truck t1 l1-5 l1-4 c1)
   deleted: (at t1 l1-5)
   added: (at t1 l1-4)
   goals met: 0 of 13
4. (load-truck p11 t2 l2-3)
   deleted: (at p11 l2-3)
   added: (in p11 t2)
   goals met: 0 of 13
5. (load-truck p3 t0 l0-5)
   deleted: (at p3 l0-5)
   added: (in p3 t0)
   goals met: 0 of 13
6. (drive-truck t3 l3-1 l3-3 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-3)
   goals met: 0 of 13
7. (fly-airplane a1 l0-0 l3-0)
   deleted: (at a1 l0-0)
   added: (at a1 l3-0)
   goals met: 0 of 13
8. (fly-airplane a3 l3-0 l2-0)
   deleted: (at a3 l3-0)
   added: (at a3 l2-0)
   goals met: 0 of 13
9. (fly-airplane a4 l3-0 l2-0)
   deleted: (at a4 l3-0)
   added: (at a4 l2-0)
   goals met: 0 of 13
10. (drive-truck t0 l0-5 l0-4 c0)
   deleted: (at t0 l0-5)
   added: (at t0 l0-4)
   goals met: 0 of 13
11. (load-truck p1 t1 l1-4)
   deleted: (at p1 l1-4)
   added: (in p1 t1)
   goals met: 0 of 13
12. (load-truck p12 t3 l3-3)
   deleted: (at p12 l3-3)
   added: (in p12 t3)
   goals met: 0 of 13
13. (drive-truck t2 l2-3 l2-4 c2)
   deleted: (at t2 l2-3)
   added: (at t2 l2-4)
   goals met: 0 of 13
14. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 0 of 13
15. (load-airplane p9 a3 l2-0)
   deleted: (at p9 l2-0)
   added: (in p9 a3)
   goals met: 0 of 13
16. (load-airplane p10 a4 l2-0)
   deleted: (at p10 l2-0)
   added: (in p10 a4)
   goals met: 0 of 13
17. (drive-truck t3 l3-3 l3-2 c3)
   deleted: (at t3 l3-3)
   added: (at t3 l3-2)
   goals met: 0 of 13
18. (load-truck p4 t2 l2-4)
   deleted: (at p4 l2-4)
   added: (in p4 t2)
   goals met: 0 of 13
19. (drive-truck t1 l1-4 l1-3 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-3)
   goals met: 0 of 13
20. (drive-truck t0 l0-4 l0-0 c0)
   deleted: (at t0 l0-4)
   added: (at t0 l0-0)
   goals met: 0 of 13
21. (fly-airplane a3 l2-0 l0-0)
   deleted: (at a3 l2-0)
   added: (at a3 l0-0)
   goals met: 0 of 13
22. (fly-airplane a4 l2-0 l3-0)
   deleted: (at a4 l2-0)
   added: (at a4 l3-0)
   goals met: 0 of 13
23. (load-truck p0 t1 l1-3)
   deleted: (at p0 l1-3)
   added: (in p0 t1)
   goals met: 0 of 13
24. (drive-truck t2 l2-4 l2-2 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-2)
   goals met: 0 of 13
25. (unload-truck p3 t0 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 0 of 13
26. (drive-truck t3 l3-2 l3-1 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-1)
   goals met: 0 of 13
27. (unload-airplane p10 a4 l3-0)
   deleted: (in p10 a4)
   added: (at p10 l3-0)
   goals met: 1 of 13
28. (unload-airplane p9 a3 l0-0)
   deleted: (in p9 a3)
   added: (at p9 l0-0)
   goals met: 1 of 13
29. (drive-truck t1 l1-3 l1-4 c1)
   deleted: (at t1 l1-3)
   added: (at t1 l1-4)
   goals met: 1 of 13
30. (load-truck p8 t2 l2-2)
   deleted: (at p8 l2-2)
   added: (in p8 t2)
   goals met: 1 of 13
31. (load-truck p6 t2 l2-2)
   deleted: (at p6 l2-2)
   added: (in p6 t2)
   goals met: 1 of 13
32. (load-truck p2 t2 l2-2)
   deleted: (at p2 l2-2)
   added: (in p2 t2)
   goals met: 1 of 13
33. (load-airplane p3 a0 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a0)
   goals met: 1 of 13
34. (unload-truck p12 t3 l3-1)
   deleted: (in p12 t3)
   added: (at p12 l3-1)
   goals met: 2 of 13
35. (load-truck p9 t0 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 2 of 13
36. (unload-truck p0 t1 l1-4)
   deleted: (in p0 t1)
   added: (at p0 l1-4)
   goals met: 3 of 13
37. (drive-truck t2 l2-2 l2-4 c2)
   deleted: (at t2 l2-2)
   added: (at t2 l2-4)
   goals met: 3 of 13
38. (drive-truck t3 l3-1 l3-2 c3)
   deleted: (at t3 l3-1)
   added: (at t3 l3-2)
   goals met: 3 of 13
39. (fly-airplane a0 l0-0 l2-0)
   deleted: (at a0 l0-0)
   added: (at a0 l2-0)
   goals met: 3 of 13
40. (drive-truck t0 l0-0 l0-4 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-4)
   goals met: 3 of 13
41. (unload-truck p2 t2 l2-4)
   deleted: (in p2 t2)
   added: (at p2 l2-4)
   goals met: 4 of 13
42. (drive-truck t1 l1-4 l1-1 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-1)
   goals met: 4 of 13
43. (drive-truck t3 l3-2 l3-0 c3)
   deleted: (at t3 l3-2)
   added: (at t3 l3-0)
   goals met: 4 of 13
44. (unload-truck p9 t0 l0-4)
   deleted: (in p9 t0)
   added: (at p9 l0-4)
   goals met: 5 of 13
45. (drive-truck t2 l2-4 l2-1 c2)
   deleted: (at t2 l2-4)
   added: (at t2 l2-1)
   goals met: 5 of 13
46. (unload-truck p1 t1 l1-1)
   deleted: (in p1 t1)
   added: (at p1 l1-1)
   goals met: 6 of 13
47. (load-truck p7 t2 l2-1)
   deleted: (at p7 l2-1)
   added: (in p7 t2)
   goals met: 6 of 13
48. (load-truck p5 t2 l2-1)
   deleted: (at p5 l2-1)
   added: (in p5 t2)
   goals met: 6 of 13
49. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 6 of 13
50. (drive-truck t2 l2-1 l2-0 c2)
   deleted: (at t2 l2-1)
   added: (at t2 l2-0)
   goals met: 6 of 13
51. (unload-truck p7 t2 l2-0)
   deleted: (in p7 t2)
   added: (at p7 l2-0)
   goals met: 6 of 13
52. (unload-truck p6 t2 l2-0)
   deleted: (in p6 t2)
   added: (at p6 l2-0)
   goals met: 6 of 13
53. (unload-truck p5 t2 l2-0)
   deleted: (in p5 t2)
   added: (at p5 l2-0)
   goals met: 6 of 13
54. (unload-truck p4 t2 l2-0)
   deleted: (in p4 t2)
   added: (at p4 l2-0)
   goals met: 6 of 13
55. (unload-truck p11 t2 l2-0)
   deleted: (in p11 t2)
   added: (at p11 l2-0)
   goals met: 6 of 13
56. (drive-truck t2 l2-0 l2-3 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-3)
   goals met: 6 of 13
57. (load-airplane p7 a0 l2-0)
   deleted: (at p7 l2-0)
   added: (in p7 a0)
   goals met: 6 of 13
58. (load-airplane p6 a0 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a0)
   goals met: 6 of 13
59. (load-airplane p5 a0 l2-0)
   deleted: (at p5 l2-0)
   added: (in p5 a0)
   goals met: 6 of 13
60. (load-airplane p4 a0 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 a0)
   goals met: 6 of 13
61. (load-airplane p11 a0 l2-0)
   deleted: (at p11 l2-0)
   added: (in p11 a0)
   goals met: 6 of 13
62. (unload-truck p8 t2 l2-3)
   deleted: (in p8 t2)
   added: (at p8 l2-3)
   goals met: 7 of 13
63. (fly-airplane a0 l2-0 l4-0)
   deleted: (at a0 l2-0)
   added: (at a0 l4-0)
   goals met: 7 of 13
64. (unload-airplane p5 a0 l4-0)
   deleted: (in p5 a0)
   added: (at p5 l4-0)
   goals met: 7 of 13
65. (unload-airplane p3 a0 l4-0)
   deleted: (in p3 a0)
   added: (at p3 l4-0)
   goals met: 7 of 13
66. (load-truck p5 t4 l4-0)
   deleted: (at p5 l4-0)
   added: (in p5 t4)
   goals met: 7 of 13
67. (fly-airplane a0 l4-0 l3-0)
   deleted: (at a0 l4-0)
   added: (at a0 l3-0)
   goals met: 7 of 13
68. (load-truck p3 t4 l4-0)
   deleted: (at p3 l4-0)
   added: (in p3 t4)
   goals met: 7 of 13
69. (unload-airplane p7 a0 l3-0)
   deleted: (in p7 a0)
   added: (at p7 l3-0)
   goals met: 7 of 13
70. (drive-truck t4 l4-0 l4-1 c4)
   deleted: (at t4 l4-0)
   added: (at t4 l4-1)
   goals met: 7 of 13
71. (fly-airplane a0 l3-0 l1-0)
   deleted: (at a0 l3-0)
   added: (at a0 l1-0)
   goals met: 7 of 13
72. (unload-truck p5 t4 l4-1)
   deleted: (in p5 t4)
   added: (at p5 l4-1)
   goals met: 8 of 13
73. (unload-truck p3 t4 l4-1)
   deleted: (in p3 t4)
   added: (at p3 l4-1)
   goals met: 9 of 13
74. (load-truck p7 t3 l3-0)
   deleted: (at p7 l3-0)
   added: (in p7 t3)
   goals met: 9 of 13
75. (unload-airplane p6 a0 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 9 of 13
76. (unload-airplane p4 a0 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 9 of 13
77. (unload-airplane p11 a0 l1-0)
   deleted: (in p11 a0)
   added: (at p11 l1-0)
   goals met: 9 of 13
78. (drive-truck t3 l3-0 l3-2 c3)
   deleted: (at t3 l3-0)
   added: (at t3 l3-2)
   goals met: 9 of 13
79. (unload-truck p7 t3 l3-2)
   deleted: (in p7 t3)
   added: (at p7 l3-2)
   goals met: 10 of 13
80. (load-truck p6 t1 l1-0)
   deleted: (at p6 l1-0)
   added: (in p6 t1)
   goals met: 10 of 13
81. (load-truck p4 t1 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 10 of 13
82. (load-truck p11 t1 l1-0)
   deleted: (at p11 l1-0)
   added: (in p11 t1)
   goals met: 10 of 13
83. (drive-truck t1 l1-0 l1-4 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-4)
   goals met: 10 of 13
84. (unload-truck p4 t1 l1-4)
   deleted: (in p4 t1)
   added: (at p4 l1-4)
   goals met: 11 of 13
85. (drive-truck t1 l1-4 l1-2 c1)
   deleted: (at t1 l1-4)
   added: (at t1 l1-2)
   goals met: 11 of 13
86. (unload-truck p11 t1 l1-2)
   deleted: (in p11 t1)
   added: (at p11 l1-2)
   goals met: 12 of 13
87. (drive-truck t1 l1-2 l1-1 c1)
   deleted: (at t1 l1-2)
   added: (at t1 l1-1)
   goals met: 12 of 13
88. (unload-truck p6 t1 l1-1)
   deleted: (in p6 t1)
   added: (at p6 l1-1)
   goals met: 13 of 13
